# Smoothness Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MaterialNode..::..Smoothness Property
MaterialNode Class See Also
---
The level of smoothness of the material.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int Smoothness { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Smoothness As Integer
	Get
```

Visual C++
---
```text
public:
property int Smoothness {
	int get ();
}
```

# See Also
MaterialNode Class
Autodesk.Revit.DB Namespace